In [4]:

import pandas as pd
import numpy as np

In [3]:
df = pd.read_excel('C:\\Users\\Minh Chi\\Downloads\\boDulieu\\lab 4-5\\JOB_INFO.xlsx')

In [5]:
df.describe(include=np.number)

             Age  WorkingYear       Salary  TrainedYear
count  44.000000    45.000000    46.000000    43.000000
mean   28.977273     4.133333  1143.847826     3.976744
std     4.406595     1.739906   238.132360     1.318158
min    22.000000     1.000000   766.000000     2.000000
25%    26.750000     3.000000   894.250000     3.000000
50%    28.500000     4.000000  1216.500000     4.000000
75%    31.000000     5.000000  1347.250000     5.000000
max    39.000000     7.000000  1457.000000     7.000000

In [6]:
df.describe(include='object')

         ENO Dept Gender Skill OverseaProject
count     46   44     45    46             46
unique    46    3      2     4              2
top     E001   IT   Male   SQL             No
freq       1   25     30    14             31

In [7]:
# kiểm tra số lượng giá trị bị thiếu 
printEmpty = df.isnull().sum()
printEmpty

ENO               0
Age               2
Dept              2
Gender            1
Skill             0
WorkingYear       1
Salary            0
TrainedYear       3
OverseaProject    0
dtype: int64

In [ ]:
# liệt kê những giá trị thiếu
# khởi tạo là giá trị boolean đơn (false)
mask = False
for col in df.columns:
    mask = mask | df[col].isnull() #nó sẽ trả về true nếu giá trị là NaN, false nếu không thực hiện mask hiện tại
    datanull = df[mask] #để chọn ra tất cả các dòng mà có ít nhất một giá trị thiếu.
datanull

,ENO,Age,Dept,Gender,Skill,WorkingYear,Salary,TrainedYear,OverseaProject
2,E003,NaN,IT,Male,SQL,6.0,1236,NaN,Yes
6,E007,27.0,NaN,Male,SQL,2.0,1154,5.0,No
7,E008,28.0,MA,Female,R,NaN,1356,6.0,Yes
9,E010,37.0,IT,NaN,C#,6.0,892,3.0,No
11,E012,NaN,HR,Male,C#,5.0,852,2.0,No
13,E014,28.0,NaN,Female,C#,4.0,766,2.0,No
18,E019,31.0,HR,Female,C#,4.0,1128,NaN,No
23,E024,30.0,IT,Male,Java,5.0,1448,NaN,No

In [ ]:
#hiển thị những trường có giá trị null và sô giá trị null
null_columns = df.columns[df.isnull().any()] # theo mặc định sẽ thực hiện trên axis=0 (theo cột), 
#nghĩa là nó kiểm tra từng cột xem có ít nhất một giá trị True (tức là ít nhất một giá trị thiếu) hay không.
print(df[null_columns].isnull().sum())

Age            2
Dept           2
Gender         1
WorkingYear    1
TrainedYear    3
dtype: int64

In [8]:
data1 = df.copy()
data1.dropna(inplace=True) # mục đích của inplace = true thì nó sẽ thay đổi trực tiếp trong dataframe gốc
check = data1.isnull().sum()
check
data1.shape

(38, 9)

In [8]:
data2 = df.copy()
data2['Age'].fillna(data2['Age'].mean(), inplace= True)
print(data2['Age'].isna().sum())

0

C:\Users\Minh Chi\AppData\Local\Temp\ipykernel_20688\305518683.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data2['Age'].fillna(data2['Age'].mean(), inplace= True)

In [ ]:
df.to_csv('D:\\learn_PyThon\\basicPython\\src\\Bai_4+5\\dataMissingOK.csv')

In [6]:
# thay the gia tri thieu cua truong gender va skill bang gia tri xuat hien thuong xuyen nhat
# The first one we find the mode() của từng trường
mode_gender = df['Gender'].mode()[0] # mục đích của số 0 thì nó sẽ lấy gia tri mode đầu tiên tránh trường hợp trùng nhiều giá trị 
mode_skills = df['Skill'].mode()[0]
#  thay the vào những trường xuất hiện thường xuyên ở nó
df['Gender'].fillna(mode_gender, inplace=True)
df['Skill'].fillna(mode_skills, inplace=True)
print(df[['Gender', 'Skill']].isnull().sum())

Gender    0
Skill     0
dtype: int64

C:\Users\Minh Chi\AppData\Local\Temp\ipykernel_18344\2239713306.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Gender'].fillna(mode_gender, inplace=True)
C:\Users\Minh Chi\AppData\Local\Temp\ipykernel_18344\2239713306.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Skill'].fillna(mode_skills, inplace=True)

In [ ]:
df['Dept'].fillna('Khongbiet', inplace= True) # nó sẽ thay đổi giá trị trên file
print(df['Dept'].isnull().sum())
print(df)

In [18]:
# df_encoded = pd.get_dummies(
#     df,
#     columns=['Dept', 'Gender', 'Skill', 'OverseaProject'],  # liệt kê các cột cần dummify
#     drop_first=True,                             # bỏ 1 dummy để tránh đa cộng tuyến (dummy trap)
#     dtype=int                                    # ép kiểu 0/1
# )

# df_encoded

In [ ]:
df.to_csv('D:\\learn_PyThon\\basicPython\\src\\Bai_4+5\\Dlht.csv')